[
	{
		"title" : "Testing Python",
		"subtitle" : "Applying Unit Testing, TDD, BDD and Acceptance Testing",
		"publisher" : "Wiley",
		"isbn" : "9781118901229",
		"description" : "Testing Python is the most comprehensive book available on testing for one of the top software programming languages in the world. Python is a natural choice for new and experienced developers, and this hands-on resource is a much needed guide to enterprise-level testing development methodologies. T...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781118901229.png",
		"author" : "David Sale",
		"rating" : 4,
		"published" : 2014,
		"price" : 21.19
	},
	{
		"title" : "Test-Driven Development in Swift",
		"subtitle" : "Compile Better Code with XCTest and TDD",
		"publisher" : "Apress",
		"isbn" : "9781484270011",
		"description" : "Leverage Swift to practice effective and efficient test-driven development (TDD) methodology. Software testing and TDD are evergreen programming concepts - yet Swift developers haven&#039;t widely adopted them. What&#039;s needed is a clear roadmap to learn and adopt TDD in the Swift world. Over the...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484270011.png",
		"author" : "Gio Lodi",
		"rating" : 4,
		"published" : 2021,
		"price" : 39.80
	},
	{
		"title" : "Test-Driven Java Development",
		"subtitle" : "Invoke TDD principles for end-to-end application development with Java",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783987429",
		"description" : "Test-driven development (TDD) is a development approach that relies on a test-first procedure that emphasises writing a test before writing the necessary code, and then refactoring the code to optimize itThe value of performing TDD with Java, one of the most established programming languages, is to ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783987429.png",
		"author" : "Viktor Farcic, Alex Garcia",
		"rating" : 4,
		"published" : 2015,
		"price" : 49.33
	},
	{
		"title" : "C# and .NET Core Test Driven Development",
		"subtitle" : "Dive into TDD to create flexible, maintainable, and production-ready .NET Core applications",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788292481",
		"description" : "This book guides developers to create robust, production-ready C# 7 and .NET Core applications through the practice of test-driven development process.In C# and .NET Core Test-Driven Development, you will learn the different stages of the TDD life cycle, basics of TDD, best practices, and anti-patte...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788292481.png",
		"author" : "Ayobami Adewole",
		"rating" : 1,
		"published" : 2018,
		"price" : 39.99
	},
	{
		"title" : "Test-Driven iOS Development with Swift, 4th Edition",
		"subtitle" : "Write maintainable, flexible, and extensible code using the power of TDD with Swift 5.5",
		"publisher" : "Packt Publishing",
		"isbn" : "9781803232485",
		"description" : "Test-driven development (TDD) is a proven way to find software bugs earlier on in software development. Writing tests before you code improves the structure and maintainability of your apps, and so using TDD in combination with Swift 5.5&#039;s improved syntax leaves you with no excuse for writing b...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781803232485.png",
		"author" : "Dr. Dominik Hauser",
		"rating" : 4,
		"published" : 2022,
		"price" : 34.99
	},
	{
		"title" : "Test Driven",
		"subtitle" : "Practical TDD and Acceptance TDD for Java Developers",
		"publisher" : "Manning",
		"isbn" : "9781932394856",
		"description" : "In test-driven development, you first write an executable test of what your application code must do. Only then do you write the code itself and, with the test spurring you on, improve your design. In acceptance test-driven development (ATDD), you use the same technique to implement product features...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781932394856.png",
		"author" : "Lasse Koskela",
		"rating" : 4,
		"published" : 2007,
		"price" : 33.70
	},
	{
		"title" : "Learn Enough JavaScript to Be Dangerous",
		"subtitle" : "Write Programs, Publish Packages, and Develop Interactive Websites with JavaScript",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780137843749",
		"description" : "JavaScript plays a key role in modern software development, not only because it is the only language that runs inside virtually all web browsers, but also because it has become widely used for back-end and general-purpose development as well. Although JavaScript is a big language, you don&#039;t nee...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780137843749.png",
		"author" : "Michael Hartl",
		"rating" : 4,
		"published" : 2022,
		"price" : 31.98
	},
	{
		"title" : "Growing Object-Oriented Software, Guided by Tests",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321503626",
		"description" : "Test-Driven Development (TDD) is now an established technique for delivering better software faster. TDD is based on a simple idea: Write tests for your code before you write the code itself. However, this &amp;quot;simple&amp;quot; idea takes skill and judgment to do well. Now there&#039;s a practi...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321503626.png",
		"author" : "Steve Freeman, Nat Pryce",
		"rating" : 4,
		"published" : 2009,
		"price" : 28.25
	},
	{
		"title" : "Test-Driven JavaScript Development",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321683915",
		"description" : "For JavaScript developers working on increasingly large and complex projects, effective automated testing is crucial to success. Test-Driven JavaScript Development is a complete, best-practice guide to agile JavaScript testing and quality assurance with the test-driven development (TDD) methodology....",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321683915.png",
		"author" : "Christian Johansen",
		"rating" : 4,
		"published" : 2010,
		"price" : 10.29
	},
	{
		"title" : "Test-Driven iOS Development",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321774187",
		"description" : "As iOS apps become increasingly complex and business-critical, iOS developers must ensure consistently superior code quality. This means adopting best practices for creating and testing iOS apps. Test-Driven Development (TDD) is one of the most powerful of these best practices. Test-Driven iOS Devel...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321774187.png",
		"author" : "Graham Lee",
		"rating" : 4,
		"published" : 2012,
		"price" : 3.99
	},
	{
		"title" : "Learning Test-Driven Development",
		"subtitle" : "A Polyglot Guide to Writing Uncluttered Code",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781098106478",
		"description" : "Your code is a testament to your skills as a developer. No matter what language you use, code should be clean, elegant, and uncluttered. By using test-driven development (TDD), you&#039;ll write code that&#039;s easy to understand, retains its elegance, and works for months, even years, to come. Wit...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781098106478.png",
		"author" : "Saleem Siddiqui",
		"rating" : 3,
		"published" : 2021,
		"price" : 53.16
	},
	{
		"title" : "Professional ASP.NET MVC 5",
		"subtitle" : "",
		"publisher" : "Wrox",
		"isbn" : "9781118794753",
		"description" : "MVC 5 is the latest update to Microsoft&#039;s popular MVC (Model-View-Controller) technology - an established web application framework that enables fast, TDD-friendly development. MVC allows developers to build dynamic, data-driven websites with sophisticated features, such as single page applicat...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781118794753.png",
		"author" : "Jon Galloway, Brad Wilson, K. Scott Allen, David Matson",
		"rating" : 4,
		"published" : 2014,
		"price" : 31.59
	},
	{
		"title" : "Design Driven Testing",
		"subtitle" : "Test Smarter, Not Harder",
		"publisher" : "Apress",
		"isbn" : "9781430229438",
		"description" : "The groundbreaking book Design Driven Testing brings sanity back to the software development process by flipping around the concept of Test Driven Development (TDD) - restoring the concept of using testing to verify a design instead of pretending that unit tests are a replacement for design. Anyone ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430229438.png",
		"author" : "Matt Stephens, Doug Rosenberg",
		"rating" : 3,
		"published" : 2010,
		"price" : 24.99
	},
	{
		"title" : "Test-Driven Development with Python",
		"subtitle" : "Obey the Testing Goat: Using Django, Selenium, and JavaScript",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449364823",
		"description" : "By taking you through the development of a real web application from beginning to end, this hands-on guide demonstrates the practical advantages of test-driven development (TDD) with Python. You&#039;ll learn how to write and run tests before building each part of your app, and then develop the mini...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449364823.png",
		"author" : "Harry J.W. Percival",
		"rating" : 4,
		"published" : 2014,
		"price" : 3.02
	},
	{
		"title" : "Thoughtful Machine Learning",
		"subtitle" : "A Test-Driven Approach",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449374068",
		"description" : "Learn how to apply test-driven development (TDD) to machine-learning algorithms - and catch mistakes that could sink your analysis. In this practical guide, author Matthew Kirk takes you through the principles of TDD and machine learning, and shows you how to apply TDD to several machine-learning al...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449374068.png",
		"author" : "Matthew Kirk",
		"rating" : 3,
		"published" : 2014,
		"price" : 21.79
	},
	{
		"title" : "Clean Ruby",
		"subtitle" : "A Guide to Crafting Better Code for Rubyists",
		"publisher" : "Apress",
		"isbn" : "9781484255452",
		"description" : "Learn how to make better decisions and write cleaner Ruby code. This book shows you how to avoid messy code that is hard to test and which cripples productivity. Author Carleton DiLeo shares hard-learned lessons gained from years of experience across numerous codebases both large and small. Each cha...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484255452.png",
		"author" : "Carleton DiLeo",
		"rating" : 3,
		"published" : 2019,
		"price" : 27.15
	},
	{
		"title" : "Python Unit Test Automation, 2nd Edition",
		"subtitle" : "Automate, Organize, and Execute Unit Tests in Python",
		"publisher" : "Apress",
		"isbn" : "9781484278536",
		"description" : "Learn how to automate unit tests of Python 3 with automation libraries, such as doctest, unittest, nose, nose2, pytest, and selenium. This book explores important concepts in software test automation and demonstrates how to automate, organize, and execute unit tests with Python. It also introduces r...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484278536.png",
		"author" : "Ashwin Pajankar",
		"rating" : 0,
		"published" : 2022,
		"price" : 39.89
	},
	{
		"title" : "Test-Driven Development with Python, 2nd Edition",
		"subtitle" : "Obey the Testing Goat: Using Django, Selenium, and JavaScript",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781491958704",
		"description" : "By taking you through the development of a real web application from beginning to end, the second edition of this hands-on guide demonstrates the practical advantages of test-driven development (TDD) with Python. You&#039;ll learn how to write and run tests before building each part of your app, and...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781491958704.png",
		"author" : "Harry Percival",
		"rating" : 4,
		"published" : 2017,
		"price" : 51.87
	},
	{
		"title" : "The Mikado Method",
		"subtitle" : "",
		"publisher" : "Manning",
		"isbn" : "9781617291210",
		"description" : "The Mikado Method presents a pragmatic process to plan and perform nontrivial technical improvements on an existing software system. The book helps you practice a step-by-step system for identifying the scope and nature of your technical debt, mapping the key dependencies, and determining a safe way...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781617291210.png",
		"author" : "Ola Ellnestam, Daniel Brolund",
		"rating" : 3,
		"published" : 2014,
		"price" : 27.76
	},
	{
		"title" : "Test-Driven React",
		"subtitle" : "Find Problems Early, Fix Them Quickly, Code with Confidence",
		"publisher" : "The Pragmatic Programmers",
		"isbn" : "9781680506464",
		"description" : "You work in a loop: write code, get feedback, iterate. The faster you get feedback, the faster you can learn and become a more effective developer. Test-Driven React helps you refine your React workflow to give you the feedback you need as quickly as possible. Write strong tests and run them continu...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781680506464.png",
		"author" : "Trevor Burnham",
		"rating" : 3,
		"published" : 2019,
		"price" : 34.72
	},
	{
		"title" : "Instant RSpec Test-Driven Development How-to",
		"subtitle" : "Learn RSpec and redefine your approach towards software development",
		"publisher" : "Packt Publishing",
		"isbn" : "9781782165224",
		"description" : "RSpec is a behaviour driven development framework for Ruby programmers. It comes integrated with its own mocking framework based on Jmock. This book introduces you to RSpec helping you to write idiomatic specifications for Ruby code in a test first approach.Instant RSpec Test-Driven Development How-...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781782165224.png",
		"author" : "Charles Feduke",
		"rating" : 3,
		"published" : 2013,
		"price" : 14.99
	},
	{
		"title" : "Test-Driven JavaScript Development",
		"subtitle" : "Learn JavaScript test-driven development using popular frameworks and tools",
		"publisher" : "Packt Publishing",
		"isbn" : "9781782174929",
		"description" : "Initially, all processing used to happen on the server-side and simple output was the response to web browsers. Nowadays, there are so many JavaScript frameworks and libraries created that help readers to create charts, animations, simulations, and so on. By the time a project finishes or reaches a ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781782174929.png",
		"author" : "Ravi Kumar Gupta, Hetal Prajapati, Harmeet Singh",
		"rating" : 5,
		"published" : 2015,
		"price" : 39.99
	},
	{
		"title" : "Shopify Application Development",
		"subtitle" : "Build highly effective Shopify apps using the powerful Ruby on Rails framework",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783281053",
		"description" : "Shopify is an e-commerce website platform that allows merchants to create and run their own online store. The Shopify App Store is a collection of apps that extend the capabilities of online stores and is a perfect place to earn recurring revenue.Shopify Application Development will teach you to bui...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783281053.png",
		"author" : "Michael Larkin",
		"rating" : 3,
		"published" : 2014,
		"price" : 17.99
	},
	{
		"title" : "JavaScript Domain-Driven Design",
		"subtitle" : "Speed up your application development by leveraging the patterns of domain-driven design",
		"publisher" : "Packt Publishing",
		"isbn" : "9781784394325",
		"description" : "JavaScript backs some of the most advanced applications. It is time to adapt modern software development practices from JavaScript to model complex business needs.JavaScript Domain-Driven Design allows you to leverage your JavaScript skills to create advanced applications. You&#039;ll start with lea...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781784394325.png",
		"author" : "Philipp Fehre",
		"rating" : 3,
		"published" : 2015,
		"price" : 39.99
	},
	{
		"title" : "RSpec Essentials",
		"subtitle" : "Develop testable, modular, and maintainable Ruby software for the real world using RSpec",
		"publisher" : "Packt Publishing",
		"isbn" : "9781784395902",
		"description" : "This book will teach you how to use RSpec to write high-value tests for real-world code. We start with the key concepts of the unit and testability, followed by hands-on exploration of key features. From the beginning, we learn how to integrate tests into the overall development process to help crea...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781784395902.png",
		"author" : "Mani Tadayon",
		"rating" : 0,
		"published" : 2016,
		"price" : 29.99
	},
	{
		"title" : "AngularJS Test-driven Development",
		"subtitle" : "Implement the best practices to improve your AngularJS applications using test-driven development",
		"publisher" : "Packt Publishing",
		"isbn" : "9781784398835",
		"description" : "Starting with reviewing the test-driven development (TDD) life cycle, you will learn how Karma and Protractor make your life easier while running JavaScript unit tests. You will learn how Protractor is different from Selenium and how to test it entirely. This book is a walk-through to using TDD to b...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781784398835.png",
		"author" : "Tim Chaplin",
		"rating" : 3,
		"published" : 2015,
		"price" : 29.99
	},
	{
		"title" : "Test-Driven iOS Development with Swift",
		"subtitle" : "Create fully-featured and highly functional iOS apps by writing tests first",
		"publisher" : "Packt Publishing",
		"isbn" : "9781785880735",
		"description" : "Test-driven development (TDD) is a proven way to find software bugs early. Writing tests before your code improves the structure and maintainability of your app.Test-driven iOS Development with Swift will help you understand the process of TDD and how it impacts your applications written in Swift. T...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781785880735.png",
		"author" : "Dr. Dominik Hauser",
		"rating" : 3,
		"published" : 2016,
		"price" : 39.99
	},
	{
		"title" : "Python Testing Cookbook, 2nd Edition",
		"subtitle" : "Easy solutions to test your Python projects using test-driven development and Selenium",
		"publisher" : "Packt Publishing",
		"isbn" : "9781787122529",
		"description" : "Automated testing is the best way to increase efficiency while reducing the defects of software testing. It helps find bugs in code easily and at an early stage so that they can be tackled efficiently. This book delves into essential testing concepts used in Python to help you build robust and maint...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781787122529.png",
		"author" : "Greg L. Turnquist, Bhaskar N. Das",
		"rating" : 3,
		"published" : 2018,
		"price" : 44.99
	},
	{
		"title" : "Building Enterprise JavaScript Applications",
		"subtitle" : "Learn to build and deploy robust JavaScript applications using Cucumber, Mocha, Jenkins, Docker, and Kubernetes",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788477321",
		"description" : "With the over-abundance of tools in the JavaScript ecosystem, it&#039;s easy to feel lost. Build tools, package managers, loaders, bundlers, linters, compilers, transpilers, typecheckers - how do you make sense of it all?In this book, we will build a simple API and React application from scratch. We...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788477321.png",
		"author" : "Daniel Li",
		"rating" : 4,
		"published" : 2018,
		"price" : 44.99
	},
	{
		"title" : "Vuex Quick Start Guide",
		"subtitle" : "Centralized State Management for your Vue.js applications",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788999939",
		"description" : "State management preserves the state of controls in a user interface. Vuex is a state management tool for Vue.js that makes the architecture easier to understand, maintain and evolve. This book is the easiest way to get started with Vuex to improve your Vue.js application architecture and overall us...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788999939.png",
		"author" : "Andrea Koutifaris",
		"rating" : 4,
		"published" : 2018,
		"price" : 29.99
	},
	{
		"title" : "Effective JavaScript",
		"subtitle" : "68 Specific Ways to Harness the Power of JavaScript",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321812186",
		"description" : "In order to truly master JavaScript, you need to learn how to work effectively with the language&#039;s flexible, expressive features and how to avoid its pitfalls. No matter how long you&#039;ve been writing JavaScript code, Effective JavaScript will help deepen your understanding of this powerful ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321812186.png",
		"author" : "David Herman",
		"rating" : 4,
		"published" : 2012,
		"price" : 21.99
	},
	{
		"title" : "Beginning JavaScript, 3nd Edition",
		"subtitle" : "The Ultimate Guide to Modern JavaScript Development",
		"publisher" : "Apress",
		"isbn" : "9781484243947",
		"description" : "Discover everything you need to know to get up-to-speed with JavaScript development and add dynamic enhancements to web pages. This completely updated third edition reveals how the code works and when to use closures, constants, and execution content. Starting with the basics, you&#039;ll see how to...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484243947.png",
		"author" : "Russ Ferguson",
		"rating" : 3,
		"published" : 2019,
		"price" : 19.02
	},
	{
		"title" : "Learning JavaScript",
		"subtitle" : "A Hands-On Guide to the Fundamentals of Modern JavaScript",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321832740",
		"description" : "With the arrival of HTML5, jQuery, and Ajax, JavaScript web development skills are more valuable  than ever! This complete, hands-on JavaScript tutorial covers everything you need to know now.  Using line-by-line code walkthroughs and end-of-chapter exercises, top web developer and speaker Tim Wrigh...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321832740.png",
		"author" : "Tim Wright",
		"rating" : 4,
		"published" : 2012,
		"price" : 8.99
	},
	{
		"title" : "jQuery and JavaScript Phrasebook",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321918963",
		"description" : "Get more done faster with jQuery and JavaScript! Brad Dayley&#039;s jQuery and JavaScript Phrasebook brings together 100+ instantly useful code snippets and idioms for performing a wide spectrum of common web application tasks. This hands-on guide gets straight to the essence of what&#039;s new and ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321918963.png",
		"author" : "Brad Dayley",
		"rating" : 4,
		"published" : 2013,
		"price" : 14.48
	},
	{
		"title" : "JavaScript: The Good Parts",
		"subtitle" : "Unearthing the Excellence in JavaScript",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596517748",
		"description" : "Most programming languages contain good and bad parts, but JavaScript has more than its share of the bad, having been developed and released in a hurry before it could be refined. This authoritative book scrapes away these bad features to reveal a subset of JavaScript that&#039;s more reliable, read...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596517748.png",
		"author" : "Douglas Crockford",
		"rating" : 4,
		"published" : 2008,
		"price" : 4.37
	},
	{
		"title" : "Head First JavaScript",
		"subtitle" : "A Learner's Companion to JavaScript",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596527747",
		"description" : "Want to make the leap from writing HTML and CSS web pages and create dynamic web applications? Want to take your web skills to the next level? It sounds like you&#039;re ready to learn the Web&#039;s hottest programming language: JavaScript. Head First JavaScript is your ticket to going beyond copyi...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596527747.png",
		"author" : "Michael Morrison",
		"rating" : 4,
		"published" : 2007,
		"price" : 7.72
	},
	{
		"title" : "High Performance JavaScript",
		"subtitle" : "Build Faster Web Application Interfaces",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596802790",
		"description" : "If you&#039;re like most developers, you rely heavily on JavaScript to build interactive and quick-responding web applications. The problem is that all of those lines of JavaScript code can slow down your apps. This book reveals techniques and strategies to help you eliminate performance bottlenecks...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596802790.png",
		"author" : "Nicholas C. Zakas",
		"rating" : 4,
		"published" : 2010,
		"price" : 19.59
	},
	{
		"title" : "Building iPhone Apps with HTML, CSS, and JavaScript",
		"subtitle" : "Making App Store Apps Without Objective-C or Cocoa",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596805784",
		"description" : "It&#039;s a fact: if you know HTML, CSS, and JavaScript, you already have the tools you need to develop your own iPhone apps. With this book, you&#039;ll learn how to use these open source web technologies to design and build apps for the iPhone and iPod Touch on the platform of your choice-without ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596805784.png",
		"author" : "Jonathan Stark",
		"rating" : 4,
		"published" : 2010,
		"price" : 5.00
	},
	{
		"title" : "JavaScript Cookbook",
		"subtitle" : "Programming the Web",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596806132",
		"description" : "Why reinvent the wheel every time you run into a problem with JavaScript? This cookbook is chock-full of code recipes that address common programming tasks, as well as techniques for building web apps that work in any browser. Just copy and paste the code samples into your project - you&#039;ll get ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596806132.png",
		"author" : "Shelley Powers",
		"rating" : 4,
		"published" : 2010,
		"price" : 7.98
	},
	{
		"title" : "JavaScript Step by Step, 2nd Edition",
		"subtitle" : "",
		"publisher" : "Microsoft Press",
		"isbn" : "9780735645523",
		"description" : "Your hands-on, step-by-step guide to the fundamentals of JavaScript development.Teach yourself how to program with JavaScript - one step at time. Ideal for developers with fundamental programming skills, this practical tutorial provides the clear guidance and hands-on examples you need to create or ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780735645523.png",
		"author" : "Steve Suehring",
		"rating" : 3,
		"published" : 2010,
		"price" : 1.49
	},
	{
		"title" : "JavaScript Step by Step, 3rd Edition",
		"subtitle" : "",
		"publisher" : "Microsoft Press",
		"isbn" : "9780735665934",
		"description" : "Expand your expertise - and teach yourself the fundamentals of JavaScript. If you have previous programming experience but are new to JavaScript, this tutorial delivers the step-by-step guidance and coding exercises you need to master core topics and techniques.Discover how to: Work with JavaScript ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780735665934.png",
		"author" : "Steve Suehring",
		"rating" : 3,
		"published" : 2013,
		"price" : 21.43
	},
	{
		"title" : "Learning JavaScript Design Patterns, 2nd Edition",
		"subtitle" : "A JavaScript and React Developer&#039;s Guide",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781098139872",
		"description" : "Do you want to write beautiful, structured, and maintainable JavaScript by applying modern design patterns to the language? Do you want clean, efficient, manageable code? Want to stay up-to-date with the latest best practices? If so, the updated second edition of Learning JavaScript Design Patterns ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781098139872.png",
		"author" : "Addy Osmani",
		"rating" : 5,
		"published" : 2023,
		"price" : 28.92
	},
	{
		"title" : "Reliable JavaScript",
		"subtitle" : "How to Code Safely in the World's Most Dangerous Language",
		"publisher" : "Wrox",
		"isbn" : "9781119028727",
		"description" : "Reliable JavaScript demonstrates how to create test-driven development for large-scale JavaScript applications that will stand the test of time and stay accurate through long-term use and maintenance. Taking a test-first approach to software architecture, this book walks you through several patterns...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781119028727.png",
		"author" : "Lawrence Spencer, Seth Richards",
		"rating" : 3,
		"published" : 2015,
		"price" : 14.74
	},
	{
		"title" : "JavaScript Programmer's Reference",
		"subtitle" : "",
		"publisher" : "Apress",
		"isbn" : "9781430246299",
		"description" : "JavaScript Programmer&#039;s Reference is an invaluable resource that won&#039;t stray far from your desktop (or your tablet!). It contains detailed information on every JavaScript object and command, and combines that reference with practical examples showcasing how you can use those commands in th...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430246299.png",
		"author" : "Thomas Valentine, Jonathan Reid",
		"rating" : 4,
		"published" : 2013,
		"price" : 35.65
	},
	{
		"title" : "Beginning JavaScript with DOM Scripting and Ajax, 2nd Edition",
		"subtitle" : "",
		"publisher" : "Apress",
		"isbn" : "9781430250920",
		"description" : "Beginning JavaScript with DOM Scripting and Ajax is an essential resource for modern JavaScript programming. This completely updated second edition covers everything you need to know to get up-to-speed with JavaScript development and add dynamic enhancements to web pages, right from the basics. As w...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430250920.png",
		"author" : "Russ Ferguson, Christian Heilmann",
		"rating" : 4,
		"published" : 2013,
		"price" : 29.00
	},
	{
		"title" : "JavaScript Creativity",
		"subtitle" : "Exploring the Modern Capabilities of JavaScript and HTML5",
		"publisher" : "Apress",
		"isbn" : "9781430259442",
		"description" : "JavaScript Creativity teaches you how to use every feature of this versatile and powerful language in exciting and creative ways. JavaScript can be used for so much more than simple interactivity. Master your use of canvas, animation, audio and video, 3D visualizations, motion detection and real-tim...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430259442.png",
		"author" : "Shane Hudson",
		"rating" : 4,
		"published" : 2014,
		"price" : 30.64
	},
	{
		"title" : "Physics for JavaScript Games, Animation, and Simulations",
		"subtitle" : "with HTML5 Canvas",
		"publisher" : "Apress",
		"isbn" : "9781430263371",
		"description" : "Have you ever wanted to include believable physical behaviors in your games and projects to give them that extra edge? Physics for JavaScript Games, Animation, and Simulations teaches you how to incorporate real physics, such as gravity, friction, and buoyancy, into your HTML5 games, animations, and...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430263371.png",
		"author" : "Dev Ramtal, Adrian Dobre",
		"rating" : 4,
		"published" : 2014,
		"price" : 49.99
	},
	{
		"title" : "Learning PHP, MySQL, JavaScript, and CSS, 2nd Edition",
		"subtitle" : "A Step-by-Step Guide to Creating Dynamic Websites",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449319267",
		"description" : "Learn how to build interactive, data-driven websites - even if you don&#039;t have any previous programming experience. If you know how to build static sites with HTML, this popular guide will help you tackle dynamic web programming. You&#039;ll get a thorough grounding in today&#039;s core open sou...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449319267.png",
		"author" : "Robin Nixon",
		"rating" : 4,
		"published" : 2012,
		"price" : 25.00
	},
	{
		"title" : "JavaScript for PHP Developers",
		"subtitle" : "A Concise Guide to Mastering JavaScript",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449320195",
		"description" : "If you want to significantly expand your web development skills beyond PHP, this practical, hands-on book teaches you ECMAScript - the core JavaScript language - from the ground up. You&#039;ll discover some similarities between JavaScript and PHP, such as conditions and loops, but the primary focus...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449320195.png",
		"author" : "Stoyan Stefanov",
		"rating" : 4,
		"published" : 2013,
		"price" : 10.50
	},
	{
		"title" : "HTML5 and JavaScript Web Apps",
		"subtitle" : "Building Apps for the Open Web",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449320515",
		"description" : "This hands-on book shows you how to work with HTML5, JavaScript MVC frameworks, and the latest W3C specifications to build mobile and desktop web apps that are widely supported across all browsers and devices. You&#039;ll quickly master building client-side applications with a loosely coupled backen...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449320515.png",
		"author" : "Wesley Hales",
		"rating" : 3,
		"published" : 2012,
		"price" : 3.88
	},
	{
		"title" : "Learning JavaScript Design Patterns",
		"subtitle" : "A JavaScript and jQuery Developer's Guide",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449331818",
		"description" : "If you want to write beautiful, structured, and maintainable JavaScript code, this guide shows you how to apply both classical and modern design patterns to the language. The patterns in this book provide reusable code solutions to common problems in software design, and give you a shared vocabulary...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449331818.png",
		"author" : "Addy Osmani",
		"rating" : 4,
		"published" : 2012,
		"price" : 23.49
	},
	{
		"title" : "The Problem with Native JavaScript APIs",
		"subtitle" : "Why reliance on native JavaScript APIs leads to disadvantages",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449339951",
		"description" : "Many features inspired by popular JavaScript libraries are now available as native JavaScript APIs in today&#039;s powerful browsers. While that may seem convenient given all of the JavaScript you need to write, relying on these APIs will only make code maintenance more difficult in the long run.In ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449339951.png",
		"author" : "Nicholas C. Zakas",
		"rating" : 0,
		"published" : 2012,
		"price" : 0.00
	},
	{
		"title" : "JavaScript Enlightenment",
		"subtitle" : "From Library User to JavaScript Developer",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449342883",
		"description" : "If you&#039;re an advanced beginner or intermediate JavaScript developer, JavaScript Enlightenment will solidify your understanding of the language - especially if you use a JavaScript library. In this concise book, JavaScript expert Cody Lindley (jQuery Cookbook) provides an accurate view of the la...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449342883.png",
		"author" : "Cody Lindley",
		"rating" : 4,
		"published" : 2012,
		"price" : 9.93
	},
	{
		"title" : "JavaScript Testing with Jasmine",
		"subtitle" : "JavaScript Behavior-Driven Development",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449356378",
		"description" : "Get a concise introduction to Jasmine, the popular behavior-driven testing framework for JavaScript. This practical guide shows you how to write unit tests with Jasmine that automatically check for bugs in your application. Learn how to write specifications for individual components, and then use th...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449356378.png",
		"author" : "Evan Hahn",
		"rating" : 3,
		"published" : 2013,
		"price" : 9.22
	},
	{
		"title" : "JavaScript & jQuery: The Missing Manual, 2nd Edition",
		"subtitle" : "",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449399023",
		"description" : "JavaScript lets you supercharge your HTML with animation, interactivity, and visual effects-but many web designers find the language hard to learn. This jargon-free guide covers JavaScript basics and shows you how to save time and effort with the jQuery library of prewritten JavaScript code. You&#03...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449399023.png",
		"author" : "David Sawyer McFarland",
		"rating" : 4,
		"published" : 2011,
		"price" : 3.99
	},
	{
		"title" : "Professional XMPP Programming with JavaScript and jQuery",
		"subtitle" : "",
		"publisher" : "Wrox",
		"isbn" : "9781457104510",
		"description" : "XMPP is a robust protocol used for a wide range of applications, including instant messaging, multi-user chat, voice and video conferencing, collaborative spaces, real-time gaming, data synchronization, and search. This book teaches you how to harness the power of XMPP in your own apps and presents ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781457104510.png",
		"author" : "Jack Moffitt",
		"rating" : 0,
		"published" : 2010,
		"price" : 0.00
	},
	{
		"title" : "HTML5 and JavaScript Projects, 2nd edition",
		"subtitle" : "Build on your Basic Knowledge of HTML5 and JavaScript to Create Substantial HTML5 Applications",
		"publisher" : "Apress",
		"isbn" : "9781484238639",
		"description" : "Build on your basic knowledge of HTML5 and JavaScript to create substantial HTML5 applications. Through the many interesting projects you can create in this book, you&#039;ll develop HTML5 skills for future projects, and extend the core skills you may have learned with its companion book, The Essent...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484238639.png",
		"author" : "Jeanine Meyer",
		"rating" : 0,
		"published" : 2018,
		"price" : 28.32
	},
	{
		"title" : "Building Web Applications with .NET Core 2.1 and JavaScript, 2nd edition",
		"subtitle" : "Leveraging Modern JavaScript Frameworks",
		"publisher" : "Apress",
		"isbn" : "9781484253519",
		"description" : "Roll up your sleeves and jump into building web applications using .NET Core 2.1 and the most popular JavaScript frameworks.You will start by building a data access layer using Entity Framework Core, a RESTful service using ASP.NET Core, and then you will build a web application following the MVC pa...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484253519.png",
		"author" : "Philip Japikse, Kevin Grossnicklaus, Ben Dewey",
		"rating" : 2,
		"published" : 2020,
		"price" : 37.70
	},
	{
		"title" : "Learn More Python 3 the Hard Way",
		"subtitle" : "The Next Step for New Python Programmers",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780134123486",
		"description" : "Zed Shaw has perfected the world&#039;s best system for becoming a truly effective Python 3.x developer. Follow it and you will succeed - just like the tens of millions of programmers he&#039;s already taught. You bring the discipline, commitment, and persistence; the author supplies everything else...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780134123486.png",
		"author" : "Zed A. Shaw",
		"rating" : 4,
		"published" : 2017,
		"price" : 22.33
	},
	{
		"title" : "Beginning Python",
		"subtitle" : "Using Python 2.6 and Python 3.1",
		"publisher" : "Wrox",
		"isbn" : "9780470414637",
		"description" : "As an open source, object-oriented programming language, Python is easy to understand, extendable, and user-friendly. This book covers every aspect of Python so that you can get started writing your own programs with Python today. Author James Payne begins with the most basic concepts of the Python ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780470414637.png",
		"author" : "James Payne",
		"rating" : 3,
		"published" : 2010,
		"price" : 7.99
	},
	{
		"title" : "C and Python Applications",
		"subtitle" : "Embedding Python Code in C Programs, SQL Methods, and Python Sockets",
		"publisher" : "Apress",
		"isbn" : "9781484277737",
		"description" : "Solve problems by embedding Python code in a C programs, SQL methods, Python sockets. This book uses rudimentary mathematics and basic programming to create practical Python applications for embedding. You&#039;ll start with an introduction to C and Python, assuming a fundamental understanding of wh...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484277737.png",
		"author" : "Philip Joyce",
		"rating" : 0,
		"published" : 2021,
		"price" : 33.74
	},
	{
		"title" : "DevOps in Python, 2nd Edition",
		"subtitle" : "Infrastructure as Python",
		"publisher" : "Apress",
		"isbn" : "9781484279953",
		"description" : "Take advantage of Python to automate complex systems with readable code. This new edition will help you move from operations/system administration into easy-to-learn coding.You&#039;ll start by writing command-line scripts and automating simple DevOps-style tasks followed by creating reliable and fa...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484279953.png",
		"author" : "Moshe Zadka",
		"rating" : 0,
		"published" : 2022,
		"price" : 26.25
	},
	{
		"title" : "Coffee Break Python Slicing",
		"subtitle" : "24 Workouts to Master Slicing in Python, Once and for All",
		"publisher" : "Self-publishing",
		"isbn" : "1001605784161",
		"description" : "Puzzle-based learning is an active learning technique. With code puzzles, you will learn faster, smarter, and better.Coffee Break Python Slicing is all about growing your Python expertise - one coffee at a time. The focus lies on the important slicing technique to access consecutive data ranges. Und...",
		"book_cover_image_url" : "https://itbook.store/img/books/1001605784161.png",
		"author" : "Christian Mayer",
		"rating" : 0,
		"published" : 2018,
		"price" : 0.00
	},
	{
		"title" : "First Semester in Numerical Analysis with Python",
		"subtitle" : "",
		"publisher" : "Self-publishing",
		"isbn" : "1001635859634",
		"description" : "The book is based on &quot;First semester in Numerical Analysis with Julia&quot;. The contents of the original book are retained, while all the algorithms are implemented in Python (Version 3.8.0). Python is an open source (under OSI), interpreted, general-purpose programming language that has a lar...",
		"book_cover_image_url" : "https://itbook.store/img/books/1001635859634.png",
		"author" : "Yaning Liu",
		"rating" : 0,
		"published" : 2020,
		"price" : 0.00
	},
	{
		"title" : "Introduction to Python for Computational Science and Engineering",
		"subtitle" : "A beginner&#039;s guide",
		"publisher" : "Self-publishing",
		"isbn" : "1001655478790",
		"description" : "This book summarises a number of core ideas relevant to Computational Engineering and Scientific Computing using Python. The emphasis is on introducing some basic Python (programming) concepts that are relevant for numerical algorithms. The later chapters touch upon numerical libraries such as numpy...",
		"book_cover_image_url" : "https://itbook.store/img/books/1001655478790.png",
		"author" : "Hans Fangohr",
		"rating" : 0,
		"published" : 2015,
		"price" : 0.00
	},
	{
		"title" : "Programming in Python 3, 2nd Edition",
		"subtitle" : "A Complete Introduction to the Python Language",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321680563",
		"description" : "It is more powerful, convenient, consistent, and expressive than ever before. Now, leading Python programmer Mark Summerfield demonstrates how to write code that takes full advantage of Python 3&#039;s features and idioms. Programming in Python 3, Second Edition, brings together all the knowledge yo...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321680563.png",
		"author" : "Mark Summerfield",
		"rating" : 4,
		"published" : 2009,
		"price" : 12.78
	},
	{
		"title" : "Learn Python the Hard Way, 3rd Edition",
		"subtitle" : "A Very Simple Introduction to the Terrifyingly Beautiful World of Computers and Code",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321884916",
		"description" : "Zed Shaw has perfected the world&#039;s best system for learning Python. Follow it and you will succeed-just like the hundreds of thousands of beginners Zed has taught to date! You bring the discipline, commitment, and persistence; the author supplies everything else.In Learn Python the Hard Way, 3r...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321884916.png",
		"author" : "Zed A. Shaw",
		"rating" : 4,
		"published" : 2013,
		"price" : 8.12
	},
	{
		"title" : "Python in Practice",
		"subtitle" : "Create Better Programs Using Concurrency, Libraries, and Patterns",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780321905635",
		"description" : "If you&#039;re an experienced Python programmer, Python in Practice will help you improve the quality, reliability, speed, maintainability, and usability of all your Python programs.Mark Summerfield focuses on four key themes: design patterns for coding elegance, faster processing through concurrenc...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780321905635.png",
		"author" : "Mark Summerfield",
		"rating" : 4,
		"published" : 2013,
		"price" : 22.50
	},
	{
		"title" : "Python Cookbook, 2nd Edition",
		"subtitle" : "Recipes from the Python Community",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596007973",
		"description" : "Portable, powerful, and a breeze to use, Python is the popular open source object-oriented programming language used for both standalone programs and scripting applications. It is now being used by an increasing number of major organizations, including NASA and Google.Updated for Python 2.4, The Pyt...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596007973.png",
		"author" : "Alex Martelli, Anna Ravenscroft, David Ascher",
		"rating" : 4,
		"published" : 2005,
		"price" : 5.18
	},
	{
		"title" : "Python Pocket Reference, 4th Edition",
		"subtitle" : "Python in Your Pocket",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596158088",
		"description" : "This is the book to reach for when you&#039;re coding on the fly and need an answer now. It&#039;s an easy-to-use reference to the core language, with descriptions of commonly used modules and toolkits, and a guide to recent changes, new features, and upgraded built-ins -- all updated to cover Pytho...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596158088.png",
		"author" : "Mark Lutz",
		"rating" : 4,
		"published" : 2009,
		"price" : 4.21
	},
	{
		"title" : "Python for Unix and Linux System Administration",
		"subtitle" : "Efficient Problem Solving with Python",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596515829",
		"description" : "Python is an ideal language for solving problems, especially for Linux and Unix. With this pragmatic book, administrators can review various tasks that often occur in the management of these systems, and learn how Python can provide a more efficient way to handle them. Once you finish this book, you...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596515829.png",
		"author" : "Noah Gift, Jeremy M. Jones",
		"rating" : 4,
		"published" : 2008,
		"price" : 39.99
	},
	{
		"title" : "Natural Language Processing with Python",
		"subtitle" : "Analyzing Text with the Natural Language Toolkit",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596516499",
		"description" : "This book offers a highly accessible introduction to Natural Language Processing, the field that underpins a variety of language technologies ranging from predictive text and email filtering to automatic summarization and translation. You&#039;ll learn how to write Python programs to analyze the str...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596516499.png",
		"author" : "Steven Bird, Ewan Klein, Edward Loper",
		"rating" : 4,
		"published" : 2009,
		"price" : 20.10
	},
	{
		"title" : "Mastering Python for Bioinformatics",
		"subtitle" : "How to Write Flexible, Documented, Tested Python Code for Research Computing",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781098100889",
		"description" : "Life scientists today urgently need training in bioinformatics skills. Too many bioinformatics programs are poorly written and barely maintained, usually by students and researchers who&#039;ve never learned basic programming skills. This practical guide shows postdoc bioinformatics professionals an...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781098100889.png",
		"author" : "Ken Youens-Clark",
		"rating" : 4,
		"published" : 2021,
		"price" : 64.90
	},
	{
		"title" : "Python for Cybersecurity",
		"subtitle" : "Using Python for Cyber Offense and Defense",
		"publisher" : "Wiley",
		"isbn" : "9781119850649",
		"description" : "Python For Cybersecurity: Using Python for Cyber Offense and Defense delivers an intuitive and hands-on explanation of using Python for cybersecurity. It relies on the MITRE ATT&amp;CK framework to structure its exploration of cyberattack techniques, attack defenses, and the key cybersecurity challe...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781119850649.png",
		"author" : "Howard E. Poston",
		"rating" : 4,
		"published" : 2022,
		"price" : 14.65
	},
	{
		"title" : "Foundations of Python Network Programming, 2nd Edition",
		"subtitle" : "The comprehensive guide to building network applications with Python",
		"publisher" : "Apress",
		"isbn" : "9781430230038",
		"description" : "You will learn fundamentals like IP, TCP, DNS and SSL by using working Python programs; you will also be able to familiarize yourself with infrastructure components like memcached and message queues. You can also delve into network server designs, and compare threaded approaches with asynchronous ev...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430230038.png",
		"author" : "John Goerzen, Brandon Rhodes",
		"rating" : 4,
		"published" : 2010,
		"price" : 39.99
	},
	{
		"title" : "Python Algorithms",
		"subtitle" : "Mastering Basic Algorithms in the Python Language",
		"publisher" : "Apress",
		"isbn" : "9781430232377",
		"description" : "Python Algorithms explains the Python approach to algorithm analysis and design. Written by Magnus Lie Hetland, author of Beginning Python, this book is sharply focused on classical algorithms, but it also gives a solid understanding of fundamental algorithmic problem-solving techniques.The book is ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430232377.png",
		"author" : "Magnus Lie Hetland",
		"rating" : 4,
		"published" : 2010,
		"price" : 18.00
	},
	{
		"title" : "Python and AWS Cookbook",
		"subtitle" : "Managing Your Cloud with Python and Boto",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449305444",
		"description" : "If you intend to use Amazon Web Services (AWS) for remote computing and storage, Python is an ideal programming language for developing applications and controlling your cloud-based infrastructure. This cookbook gets you started with more than two dozen recipes for using Python with AWS, based on th...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449305444.png",
		"author" : "Mitch Garnaat",
		"rating" : 4,
		"published" : 2011,
		"price" : 12.99
	},
	{
		"title" : "MongoDB and Python",
		"subtitle" : "Patterns and processes for the popular document-oriented database",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449310370",
		"description" : "Learn how to leverage MongoDB with your Python applications, using the hands-on recipes in this book. You get complete code samples for tasks such as making fast geo queries for location-based apps, efficiently indexing your user documents for social-graph lookups, and many other scenarios.This guid...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449310370.png",
		"author" : "Niall O'Higgins",
		"rating" : 3,
		"published" : 2011,
		"price" : 6.88
	},
	{
		"title" : "Learning Redis",
		"subtitle" : "Design efficient web and business solutions with Redis",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783980123",
		"description" : "This book will introduce Redis and help you understand its various facets.Starting with an introduction to NoSQL, you will learn how to install Redis and how to classify and work with data structures. By working with real world scenarios pertaining to using Redis, you will discover sharding and inde...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783980123.png",
		"author" : "Vinoo Das",
		"rating" : 3,
		"published" : 2015,
		"price" : 44.99
	},
	{
		"title" : "Redis Essentials",
		"subtitle" : "Harness the power of Redis to integrate and manage your projects efficiently",
		"publisher" : "Packt Publishing",
		"isbn" : "9781784392451",
		"description" : "Redis is the most popular in-memory key-value data store. It&#039;s very lightweight and its data types give it an edge over the other competitors. If you need an in-memory database or a high-performance cache system that is simple to use and highly scalable, Redis is what you need.Redis Essentials ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781784392451.png",
		"author" : "Maxwell Dayvson Da Silva, Hugo Lopes Tavares",
		"rating" : 4,
		"published" : 2015,
		"price" : 39.99
	},
	{
		"title" : "The Little Redis Book",
		"subtitle" : "",
		"publisher" : "Self-publishing",
		"isbn" : "1001591950933",
		"description" : "The book is many years old, but still relevant. Redis has evolved a lot, but most of that has been in the form of internal improvements, new advanced features (like lua scripting) and awesome new data types. The best way to learn Redis is still to start by understanding the fundamentals presented in...",
		"book_cover_image_url" : "https://itbook.store/img/books/1001591950933.png",
		"author" : "Karl Seguin",
		"rating" : 0,
		"published" : 2017,
		"price" : 0.00
	},
	{
		"title" : "How To Manage a Redis Database",
		"subtitle" : "",
		"publisher" : "DigitalOcean",
		"isbn" : "9780999773079",
		"description" : "This book aims to provide an approachable introduction to Redis concepts by outlining many of the key-value store&#039;s commands so readers can learn their patterns and syntax, thus building up readers&#039; understanding gradually. The goal for this book is to serve as an introduction to Redis for...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780999773079.png",
		"author" : "Mark Drake",
		"rating" : 0,
		"published" : 2020,
		"price" : 0.00
	},
	{
		"title" : "Redis For Dummies",
		"subtitle" : "",
		"publisher" : "Wiley",
		"isbn" : "9781119824275",
		"description" : "NoSQL is a modern data persistence storage paradigm that provides data persistence for environments where high performance is a primary requirement. Within NoSQL, data is stored in such a way as to make both writing and reading quite fast, even under heavy load.Redis and Redis Enterprise are market-...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781119824275.png",
		"author" : "Steve Suehring",
		"rating" : 0,
		"published" : 2021,
		"price" : 0.00
	},
	{
		"title" : "Redis Cookbook",
		"subtitle" : "Practical Techniques for Fast Data Manipulation",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449305048",
		"description" : "Two years since its initial release, Redis already has an impressive list of adopters, including Engine Yard, GitHub, Craigslist, and Digg. This open source data structure server is built for speed and flexibility, making it ideal for many applications. If you&#039;re using Redis, or considering it,...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449305048.png",
		"author" : "Tiago Macedo, Fred Oliveira",
		"rating" : 3,
		"published" : 2011,
		"price" : 15.99
	},
	{
		"title" : "Redis in Action",
		"subtitle" : "",
		"publisher" : "Manning",
		"isbn" : "9781617290855",
		"description" : "Redis in Action introduces Redis and the key-value model. You&#039;ll quickly dive into real use cases including simple caching, distributed ad targeting, and more. You&#039;ll learn how to scale Redis from small jobs to massive datasets and discover how to integrate with traditional RDBMS or other ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781617290855.png",
		"author" : "Josiah L. Carlson",
		"rating" : 4,
		"published" : 2013,
		"price" : 7.99
	},
	{
		"title" : "Spring Data Programming Cookbook",
		"subtitle" : "",
		"publisher" : "Self-publishing",
		"isbn" : "1001651853027",
		"description" : "Spring Data&#039;s mission is to provide a familiar and consistent, Spring-based programming model for data access while still retaining the special traits of the underlying data store.It makes it easy to use data access technologies, relational and non-relational databases, map-reduce frameworks, a...",
		"book_cover_image_url" : "https://itbook.store/img/books/1001651853027.png",
		"author" : "JCGs",
		"rating" : 0,
		"published" : 2016,
		"price" : 0.00
	},
	{
		"title" : "The Pragmatic Programmer, 20th Anniversary Edition",
		"subtitle" : "Your journey to mastery",
		"publisher" : "The Pragmatic Programmers",
		"isbn" : "9780135957059",
		"description" : "For twenty years, the lessons from The Pragmatic Programmer have helped a generation of programmers examine the very essence of software development, independent of any particular language, framework, or methodology. This classic title is regularly featured on &quot;Top Ten&quot; lists, and many cor...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780135957059.png",
		"author" : "David Thomas, Andrew Hunt",
		"rating" : 4,
		"published" : 2019,
		"price" : 31.99
	},
	{
		"title" : "Facebook & Twitter For Seniors For Dummies",
		"subtitle" : "",
		"publisher" : "Wiley",
		"isbn" : "9780470637548",
		"description" : "People over 55 were the fastest-growing user group on Facebook in the first half of 2009, and they&#039;re flocking to Twitter at a faster rate than their under-20 grandchildren. From basic information about establishing an Internet connection to rediscovering old friends, sharing messages and photo...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780470637548.png",
		"author" : "Marsha Collier",
		"rating" : 4,
		"published" : 2010,
		"price" : 3.69
	},
	{
		"title" : "Pro Dynamic .NET 4.0 Applications",
		"subtitle" : "Data-Driven Programming for the .NET Framework",
		"publisher" : "Apress",
		"isbn" : "9781430225195",
		"description" : "As a developer you are likely painfully aware that not all features of an application can be anticipated when the software ships. In order to cope with these eventualities and save yourself time (and perhaps money), it makes sense to write your applications in such a way that end users can be made a...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781430225195.png",
		"author" : "Carl Ganz",
		"rating" : 3,
		"published" : 2010,
		"price" : 27.17
	},
	{
		"title" : "Resilience and Reliability on AWS",
		"subtitle" : "Engineering at Cloud Scale",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449339197",
		"description" : "Cloud services are just as susceptible to network outages as any other platform. This concise book shows you how to prepare for potentially devastating interruptions by building your own resilient and reliable applications in the public cloud. Guided by engineers from 9apps - n independent provider ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449339197.png",
		"author" : "Jurg van Vliet, Flavia Paganelli, Jasper Geurtsen",
		"rating" : 3,
		"published" : 2013,
		"price" : 11.92
	},
	{
		"title" : "OpenStack Trove",
		"subtitle" : "",
		"publisher" : "Apress",
		"isbn" : "9781484212226",
		"description" : "OpenStack Trove is your step-by-step guide to set up and run a secure and scalable cloud Database as a Service (DBaaS) solution. The book shows you how to set up and configure the Trove DBaaS framework, use prepackaged or custom database implementations, and provision and operate a variety of databa...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484212226.png",
		"author" : "Amrith Kumar, Douglas Shelley",
		"rating" : 4,
		"published" : 2015,
		"price" : 38.46
	},
	{
		"title" : "Web Applications on Azure",
		"subtitle" : "Developing for Global Scale",
		"publisher" : "Apress",
		"isbn" : "9781484229750",
		"description" : "Build .NET apps on Microsoft Azure services that can grow to Internet scale. Learn how you can make smart application architecture decisions and follow best practices so that your website can handle tens of thousands of concurrent users and deliver your content globally.Author Rob Reagan takes you t...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484229750.png",
		"author" : "Rob Reagan",
		"rating" : 4,
		"published" : 2018,
		"price" : 37.35
	},
	{
		"title" : "Hands-on GitHub Actions",
		"subtitle" : "Implement CI/CD with GitHub Action Workflows for Your Applications",
		"publisher" : "Apress",
		"isbn" : "9781484264638",
		"description" : "Implement continuous integration/continuous delivery (CI/CD) workflows for any application you develop through GitHub Actions. This book will give you an in-depth idea of implementation patterns, solutions for different technology builds, guidelines to implement your own custom components as actions...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484264638.png",
		"author" : "Chaminda Chandrasekara, Pushpa Herath",
		"rating" : 3,
		"published" : 2021,
		"price" : 37.99
	},
	{
		"title" : "Modern Data Engineering with Apache Spark",
		"subtitle" : "A Hands-On Guide for Building Mission-Critical Streaming Applications",
		"publisher" : "Apress",
		"isbn" : "9781484274514",
		"description" : "Leverage Apache Spark within a modern data engineering ecosystem. This hands-on guide will teach you how to write fully functional applications, follow industry best practices, and learn the rationale behind these decisions. With Apache Spark as the foundation, you will follow a step-by-step journey...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484274514.png",
		"author" : "Scott Haines",
		"rating" : 5,
		"published" : 2022,
		"price" : 46.38
	},
	{
		"title" : "Node.js 8 the Right Way",
		"subtitle" : "Practical, Server-Side JavaScript That Scales",
		"publisher" : "The Pragmatic Programmers",
		"isbn" : "9781680501957",
		"description" : "JavaScript is the backbone of the modern web, powering nearly every web app&#039;s user interface. Node.js is JavaScript for the server. This greatly expanded second edition introduces new language features while dramatically increasing coverage of core topics. Each hands-on chapter offers progressi...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781680501957.png",
		"author" : "Jim R. Wilson",
		"rating" : 4,
		"published" : 2017,
		"price" : 27.99
	},
	{
		"title" : "Seven Databases in Seven Weeks, 2nd Edition",
		"subtitle" : "A Guide to Modern Databases and the NoSQL Movement",
		"publisher" : "The Pragmatic Programmers",
		"isbn" : "9781680502534",
		"description" : "Data is getting bigger and more complex by the day, and so are your choices in handling it. Explore some of the most cutting-edge databases available - from a traditional relational database to newer NoSQL approaches - and make informed decisions about challenging data storage problems. This is the ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781680502534.png",
		"author" : "Luc Perkins, Jim Wilson, Eric Redmond",
		"rating" : 4,
		"published" : 2018,
		"price" : 28.50
	},
	{
		"title" : "Rediscovering JavaScript",
		"subtitle" : "Master ES6, ES7, and ES8",
		"publisher" : "The Pragmatic Programmers",
		"isbn" : "9781680505467",
		"description" : "JavaScript is a black swan that no one, including the author of the language, thought would become a popular and ubiquitous language. Not long ago, it was the most hated and feared language you could use to program the web. JavaScript ES6 and beyond has gone through a significant makeover. Troubleso...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781680505467.png",
		"author" : "Venkat Subramaniam",
		"rating" : 4,
		"published" : 2018,
		"price" : 37.94
	},
	{
		"title" : "Learning Storm",
		"subtitle" : "Create real-time stream processing applications with Apache Storm",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783981328",
		"description" : "Starting with the very basics of Storm, you will learn how to set up Storm on a single machine and move on to deploying Storm on your cluster. You will understand how Kafka can be integrated with Storm using the Kafka spout.You will then proceed to explore the Trident abstraction tool with Storm to ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783981328.png",
		"author" : "Ankit Jain, Anand Nalya",
		"rating" : 4,
		"published" : 2014,
		"price" : 8.99
	},
	{
		"title" : "Spring MVC Cookbook",
		"subtitle" : "Over 40 recipes for creating cloud-ready Java web applications with Spring MVC",
		"publisher" : "Packt Publishing",
		"isbn" : "9781784396411",
		"description" : "Spring MVC is a lightweight application framework that comes with a great configuration by default. Being part of the Spring Framework, it naturally extended and supported it with an amazing set of recognizable annotations. External libraries can be plugged in and plugged out. It also possesses a re...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781784396411.png",
		"author" : "Alex Bretet",
		"rating" : 4,
		"published" : 2016,
		"price" : 54.99
	},
	{
		"title" : "Just Spring",
		"subtitle" : "A lightweight introduction to the Spring Framework",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449306403",
		"description" : "Get a concise introduction to Spring, the increasingly popular open source framework for building lightweight enterprise applications on the Java platform. This example - driven book for Java developers delves into the framework&#039;s basic features, as well as advanced concepts such as containers....",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449306403.png",
		"author" : "Madhusudhan Konda",
		"rating" : 3,
		"published" : 2011,
		"price" : 6.15
	},
	{
		"title" : "Just Spring Integration",
		"subtitle" : "A Lightweight Introduction to Spring Integration",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449316082",
		"description" : "Get started with Spring Integration, the lightweight Java-based framework that makes designing and developing message-oriented architectures a breeze. Through numerous examples, you&#039;ll learn how to use this open source framework&#039;s basic building blocks to work with both inter - and intra-a...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449316082.png",
		"author" : "Madhusudhan Konda",
		"rating" : 3,
		"published" : 2012,
		"price" : 16.99
	},
	{
		"title" : "Just Spring Data Access",
		"subtitle" : "Covers JDBC, Hibernate, JPA and JDO",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449328382",
		"description" : "JDBC has simplified database access in Java applications, but a few nagging wrinkles remain - namely, persisting Java objects to relational databases. With this book, you&#039;ll learn how the Spring Framework makes that job incredibly easy with dependency injection, template classes, and object-rel...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449328382.png",
		"author" : "Madhusudhan Konda",
		"rating" : 2,
		"published" : 2012,
		"price" : 15.82
	},
	{
		"title" : "Spring Persistence with Hibernate, 2nd Edition",
		"subtitle" : "",
		"publisher" : "Apress",
		"isbn" : "9781484202692",
		"description" : "Learn how to use the core Hibernate APIs and tools as part of the Spring Framework. This book illustrates how these two frameworks can be best utilized. Other persistence solutions available in Spring are also shown including the Java Persistence API (JPA).Spring Persistence with Hibernate, Second E...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484202692.png",
		"author" : "Brian D. Murphy, Paul Fisher",
		"rating" : 3,
		"published" : 2016,
		"price" : 33.19
	},
	{
		"title" : "Spring REST",
		"subtitle" : "Rest and web services development using Spring",
		"publisher" : "Apress",
		"isbn" : "9781484208243",
		"description" : "Spring REST is a practical guide for designing and developing RESTful APIs using the Spring Framework. This book walks you through the process of designing and building a REST application while taking a deep dive into design principles and best practices for versioning, security, documentation, erro...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484208243.png",
		"author" : "Sudha Belida, Balaji Varanasi",
		"rating" : 4,
		"published" : 2015,
		"price" : 47.10
	},
	{
		"title" : "Pivotal Certified Professional Core Spring 5 Developer Exam, 2nd Edition",
		"subtitle" : "A Study Guide Using Spring Framework 5",
		"publisher" : "Apress",
		"isbn" : "9781484251355",
		"description" : "Pass the Pivotal Certified Professional exam for Core Spring, based on the latest Spring Framework 5, using source code examples, study summaries, and mock exams. This book now includes WebFlux, reactive programming, and more found in Spring 5. You&#039;ll find a descriptive overview of certificatio...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484251355.png",
		"author" : "Iuliana Cosmina",
		"rating" : 4,
		"published" : 2020,
		"price" : 39.99
	},
	{
		"title" : "Spring Boot Persistence Best Practices",
		"subtitle" : "Optimize Java Persistence Performance in Spring Boot Applications",
		"publisher" : "Apress",
		"isbn" : "9781484256251",
		"description" : "This book is a collection of developer code recipes and best practices for persisting data using Spring, particularly Spring Boot. The book is structured around practical recipes, where each recipe discusses a performance case or performance-related case, and almost every recipe has one or more appl...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484256251.png",
		"author" : "Leonard Anghel",
		"rating" : 4,
		"published" : 2020,
		"price" : 43.98
	},
	{
		"title" : "Spring Boot with React and AWS",
		"subtitle" : "Learn to Deploy a Full Stack Spring Boot React Application to AWS",
		"publisher" : "Apress",
		"isbn" : "9781484273913",
		"description" : "Create and deploy full-stack Spring Boot applications with React and AWS. This practical and authoritative guide teaches you the fundamentals of Amazon Web Services with no prior experience.You will start by learning the fundamentals of AWS, including EC2, S3, IAM, and load balancer. Next, you will ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484273913.png",
		"author" : "Ravi Kant Soni, Namrata Soni",
		"rating" : 5,
		"published" : 2021,
		"price" : 42.80
	},
	{
		"title" : "Spring 6 Recipes, 5th Edition",
		"subtitle" : "A Problem-Solution Approach to Spring Framework",
		"publisher" : "Apress",
		"isbn" : "9781484286487",
		"description" : "This in-depth Spring-based Java developer code reference has been updated and now solves many of your Spring Framework 6 problems using reusable, complete and real-world working code examples. Spring 6 Recipes (5th Edition) now includes Spring Native which speeds up your Java-based Spring Framework ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484286487.png",
		"author" : "Marten Deinum, Daniel Rubio, Josh Long",
		"rating" : 0,
		"published" : 2023,
		"price" : 35.84
	},
	{
		"title" : "Beginning Spring Data",
		"subtitle" : "Data Access and Persistence for Spring Framework 6 and Boot 3",
		"publisher" : "Apress",
		"isbn" : "9781484287637",
		"description" : "Use the popular Spring Data project for data access and persistence using various Java-based APIs such as JDBC, JPA, MongoDB, and more. This book shows how to easily incorporate data persistence and accessibility into your microservices, cloud-native applications, and monolithic enterprise applicati...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484287637.png",
		"author" : "Andres Sacco",
		"rating" : 5,
		"published" : 2023,
		"price" : 33.99
	},
	{
		"title" : "Spring in Action, 4th Edition",
		"subtitle" : "Covers Spring 4",
		"publisher" : "Manning",
		"isbn" : "9781617291203",
		"description" : "Spring in Action, 4th Edition is a hands-on guide to the Spring Framework. It covers Spring core, along with the latest updates to Spring MVC, Security, Web Flow, and more. You&#039;ll move between short snippets and an ongoing example as you learn to build simple and efficient JEE applications. Aut...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781617291203.png",
		"author" : "Craig Walls",
		"rating" : 4,
		"published" : 2014,
		"price" : 25.29
	},
	{
		"title" : "Cloud Native Spring in Action",
		"subtitle" : "With Spring Boot and Kubernetes",
		"publisher" : "Manning",
		"isbn" : "9781617298424",
		"description" : "Cloud Native Spring in Action is a practical guide to building applications that are designed for cloud environments. You&#039;ll learn effective Spring and Kubernetes cloud development techniques that you can immediately apply to enterprise-grade applications. Follow a detailed and complete cloud n...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781617298424.png",
		"author" : "Thomas Vitale",
		"rating" : 5,
		"published" : 2022,
		"price" : 59.83
	},
	{
		"title" : "Spring for Android Starter",
		"subtitle" : "Leverage Spring for Android to create RESTful and OAuth Android apps",
		"publisher" : "Packt Publishing",
		"isbn" : "9781782161905",
		"description" : "Learn something new in an Instant! A short, fast, focused guide delivering immediate results. Learn what Spring for Android adds to the Android developer toolkit. Learn how to debug your Android communication layer observing HTTP requests and responses. Use OAuth to authenticate your users and your ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781782161905.png",
		"author" : "Anthony Dahanne",
		"rating" : 0,
		"published" : 2013,
		"price" : 14.99
	},
	{
		"title" : "Mockito for Spring",
		"subtitle" : "Learn all you need to know about the Spring Framework and how to unit test your projects with Mockito",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783983780",
		"description" : "Mockito is a testing framework that creates external dependencies; this process is called mocking. This book will provide you with the skills you need to successfully build and maintain meaningful unit and integration test cases for Spring Framework code. This book starts with a brief introduction t...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783983780.png",
		"author" : "Sujoy Acharya",
		"rating" : 3,
		"published" : 2015,
		"price" : 24.99
	},
	{
		"title" : "Learning Spring Application Development",
		"subtitle" : "Develop dynamic, feature-rich, and robust Spring-based applications using the Spring Framework",
		"publisher" : "Packt Publishing",
		"isbn" : "9781783987368",
		"description" : "With this practical guide, you will learn best practices through real-world projects and follow a simple, practical approach to developing high performance and enterprise-grade Java applications with Spring.Starting with the architecture of the Spring Framework and setting up the key components of t...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781783987368.png",
		"author" : "Ravi Kant Soni",
		"rating" : 3,
		"published" : 2015,
		"price" : 49.99
	},
	{
		"title" : "Mastering Spring Boot 2.0",
		"subtitle" : "Build modern, cloud-native, and distributed systems using Spring Boot",
		"publisher" : "Packt Publishing",
		"isbn" : "9781787127562",
		"description" : "Spring is one of the best frameworks on the market for developing web, enterprise, and cloud ready software. Spring Boot simplifies the building of complex software dramatically by reducing the amount of boilerplate code, and by providing production-ready features and a simple deployment model.This ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781787127562.png",
		"author" : "Dinesh Rajput",
		"rating" : 3,
		"published" : 2018,
		"price" : 49.99
	},
	{
		"title" : "Mastering Spring Cloud",
		"subtitle" : "Build self-healing, microservices-based, distributed systems using Spring Cloud",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788475433",
		"description" : "Developing, deploying, and operating cloud applications should be as easy as local applications. This should be the governing principle behind any cloud platform, library, or tool. Spring Cloud - an open-source library - makes it easy to develop JVM applications for the cloud. In this book, you will...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788475433.png",
		"author" : "Piotr Minkowski",
		"rating" : 4,
		"published" : 2018,
		"price" : 49.99
	},
	{
		"title" : "Building Applications with Spring 5 and Vue.js 2",
		"subtitle" : "Build a modern, full-stack web application using Spring Boot and Vuex",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788836968",
		"description" : "Building Applications with Spring 5 and Vue.js 2, with its practical approach, helps you become a full-stack web developer. As well as knowing how to write frontend and backend code, a developer has to tackle all problems encountered in the application development life cycle - starting from the simp...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788836968.png",
		"author" : "James J. Ye",
		"rating" : 3,
		"published" : 2018,
		"price" : 44.99
	},
	{
		"title" : "Hands-On High Performance with Spring 5",
		"subtitle" : "Techniques for scaling and optimizing Spring and Spring Boot applications",
		"publisher" : "Packt Publishing",
		"isbn" : "9781788838382",
		"description" : "While writing an application, performance is paramount. Performance tuning for real-world applications often involves activities geared toward detecting bottlenecks. The recent release of Spring 5.0 brings major advancements in the rich API provided by the Spring framework, which means developers ne...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781788838382.png",
		"author" : "Chintan Mehta, Subhash Shah, Pritesh Shah, Prashant Goswami, Dinesh Radadiya",
		"rating" : 2,
		"published" : 2018,
		"price" : 49.99
	},
	{
		"title" : "MySQL Enterprise Solutions",
		"subtitle" : "",
		"publisher" : "Wiley",
		"isbn" : "9780471269229",
		"description" : "With more than three million users, MySQL is the most popular open-source database server in the world, providing an extremely fast, reliable, and inexpensive alternative to commercial database management systems. Gives corporate users a complete guide to building enterprise-level database applicati...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780471269229.png",
		"author" : "Alexander Pachev",
		"rating" : 4,
		"published" : 2003,
		"price" : 42.98
	},
	{
		"title" : "Understanding MySQL Internals",
		"subtitle" : "Discovering and Improving a Great Database",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596009571",
		"description" : "Although MySQL&#039;s source code is open in the sense of being publicly available, it&#039;s essentially closed to you if you don&#039;t understand it. This book provides a comprehensive tour of MySQL 5 that shows you how to figure out the inner-workings of this powerful database. You&#039;ll learn...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596009571.png",
		"author" : "Sasha Pachev",
		"rating" : 3,
		"published" : 2007,
		"price" : 32.11
	},
	{
		"title" : "MySQL Stored Procedure Programming",
		"subtitle" : "Building High-Performance Web Applications in MySQL",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596100896",
		"description" : "MySQL Stored Procedure Programming covers a lot of ground. The book starts with a thorough introduction to stored procedures programming and functions, covering the fundamentals of data types, operators, and using SQL in stored procedures. You&#039;ll learn how to build and maintain stored programs ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596100896.png",
		"author" : "Guy Harrison, Steven Feuerstein",
		"rating" : 4,
		"published" : 2006,
		"price" : 6.38
	},
	{
		"title" : "MySQL in a Nutshell, 2nd Edition",
		"subtitle" : "",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596514334",
		"description" : "When you need to find the right SQL keyword or MySQL client command-line option right away, turn to this convenient reference, known for the same speed and flexibility as the system it covers so thoroughly. MySQL is packed with so many capabilities that the odds of remembering a particular function ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596514334.png",
		"author" : "Russell Dyer",
		"rating" : 4,
		"published" : 2008,
		"price" : 5.20
	},
	{
		"title" : "PHP & MySQL: The Missing Manual",
		"subtitle" : "",
		"publisher" : "O'Reilly Media",
		"isbn" : "9780596515867",
		"description" : "If you can build websites with CSS and JavaScript, this book takes you to the next level-creating dynamic, database-driven websites with PHP and MySQL. Learn how to build a database, manage your content, and interact with users through queries and web forms. With step-by-step tutorials, real-world e...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780596515867.png",
		"author" : "Brett McLaughlin",
		"rating" : 4,
		"published" : 2011,
		"price" : 4.22
	},
	{
		"title" : "PHP and MySQL Web Development, 4th Edition",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780672329166",
		"description" : "PHP and MySQL are popular open-source technologies that are ideal for quickly developing database-driven Web applications. PHP is a powerful scripting language designed to enable developers to create highly featured Web applications quickly, and MySQL is a fast, reliable database that integrates wel...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780672329166.png",
		"author" : "Luke Welling, Laura Thomson",
		"rating" : 4,
		"published" : 2008,
		"price" : 5.96
	},
	{
		"title" : "PHP and MySQL 24-Hour Trainer",
		"subtitle" : "",
		"publisher" : "Wrox",
		"isbn" : "9781118066881",
		"description" : "Assuming no previous experience with PHP or MySQL, this book is ideal reading for anyone who wants to go beyond HTML / CSS in order to provide clients with the most dynamic web sites possible. The approachable tone breaks down the basics of programming and PHP and MySQL in individual lessons startin...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781118066881.png",
		"author" : "Andrea Tarr",
		"rating" : 4,
		"published" : 2011,
		"price" : 19.99
	},
	{
		"title" : "Learning MySQL and MariaDB",
		"subtitle" : "Heading in the Right Direction with MySQL and MariaDB",
		"publisher" : "O'Reilly Media",
		"isbn" : "9781449362904",
		"description" : "If you&#039;re a programmer new to databases - or just new to MySQL and its community-driven variant, MariaDB - you&#039;ve found the perfect introduction. This hands-on guide provides an easy, step-by-step approach to installing, using, and maintaining these popular relational database engines.Auth...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781449362904.png",
		"author" : "Russell J.T. Dyer",
		"rating" : 5,
		"published" : 2015,
		"price" : 38.70
	},
	{
		"title" : "PHP and MySQL Recipes, 2nd Edition",
		"subtitle" : "A Problem-Solution Approach",
		"publisher" : "Apress",
		"isbn" : "9781484206065",
		"description" : "This book is a source of instant solutions, including countless pieces of useful code that you can copy and paste into your own applications, giving you answers fast and saving you hours of coding time. You can also use this book as a reference to the most important aspects of the latest PHP scripti...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484206065.png",
		"author" : "Frank M. Kromann",
		"rating" : 5,
		"published" : 2016,
		"price" : 48.06
	},
	{
		"title" : "MySQL Connector/Python Revealed",
		"subtitle" : "SQL and NoSQL Data Storage Using MySQL for Python Programmers",
		"publisher" : "Apress",
		"isbn" : "9781484236932",
		"description" : "Move data back and forth between database and application. The must-have knowledge in this book helps programmers learn how to use the official driver, MySQL Connector/Python, by which Python programs communicate with the MySQL database. This book takes you from the initial installation of the conne...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484236932.png",
		"author" : "Jesper Wisborg Krogh",
		"rating" : 0,
		"published" : 2018,
		"price" : 24.27
	},
	{
		"title" : "MySQL Concurrency",
		"subtitle" : "Locking and Transactions for MySQL Developers and DBAs",
		"publisher" : "Apress",
		"isbn" : "9781484266519",
		"description" : "Know how locks work in MySQL and how they relate to transactions. This book explains the major role that locks play in database systems, showing how locks are essential in allowing high-concurrency workloads. You will learn about lock access levels and lock granularities from the user level as well ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781484266519.png",
		"author" : "Jesper Wisborg Krogh",
		"rating" : 4,
		"published" : 2021,
		"price" : 49.02
	},
	{
		"title" : "The MySQL Workshop",
		"subtitle" : "A practical guide to working with data and managing databases with MySQL",
		"publisher" : "Packt Publishing",
		"isbn" : "9781839214905",
		"description" : "Do you want to learn how to create and maintain databases effectively? Are you looking for simple answers to basic MySQL questions as well as straightforward examples that you can use at work? If so, this workshop is the right choice for you.Designed to build your confidence through hands-on practic...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781839214905.png",
		"author" : "Thomas Pettit, Scott Cosentino",
		"rating" : 0,
		"published" : 2022,
		"price" : 51.99
	},
	{
		"title" : "High Availability MySQL Cookbook",
		"subtitle" : "Over 50 simple but incredibly effective recipes focusing on different methods of achieving high availability for MySQL databases",
		"publisher" : "Packt Publishing",
		"isbn" : "9781847199942",
		"description" : "This book covers all the major techniques available for increasing availability of your MySQL databases. It demonstrates how to design, implement, troubleshoot and manage a highly available MySQL setup using any one of several techniques, which are shown in different recipes. It is based on MySQL Cl...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781847199942.png",
		"author" : "Alex Davies",
		"rating" : 4,
		"published" : 2010,
		"price" : 26.99
	},
	{
		"title" : "MySQL for Python",
		"subtitle" : "Integrate the flexibility of Python and the power of MySQL to boost the productivity of your applications",
		"publisher" : "Packt Publishing",
		"isbn" : "9781849510189",
		"description" : "Python is a dynamic programming language, which is completely enterprise ready, owing largely to the variety of support modules that are available to extend its capabilities. In order to build productive and feature-rich Python applications, we need to use MySQL for Python, a module that provides da...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781849510189.png",
		"author" : "Albert Lukaszewski",
		"rating" : 3,
		"published" : 2010,
		"price" : 29.99
	},
	{
		"title" : "MySQL 5.1 Plugin Development",
		"subtitle" : "Extend MySQL to suit your needs with this unique guide into the world of MySQL plugins",
		"publisher" : "Packt Publishing",
		"isbn" : "9781849510608",
		"description" : "MySQL has introduced a Plugin API with its latest version - a robust, powerful, and easy way of extending the server functionality with loadable modules on the fly. But until now anyone wishing to develop a plugin would almost certainly need to dig into the MySQL source code and search the Web for m...",
		"book_cover_image_url" : "https://itbook.store/img/books/9781849510608.png",
		"author" : "Andrew Hutchings, Sergei Golubchik",
		"rating" : 4,
		"published" : 2010,
		"price" : 26.99
	},
	{
		"title" : "MySQL Notes for Professionals",
		"subtitle" : "",
		"publisher" : "Self-publishing",
		"isbn" : "1001620983366",
		"description" : "The MySQL Notes for Professionals book is compiled from Stack Overflow Documentation, the content is written by the beautiful people at Stack Overflow....",
		"book_cover_image_url" : "https://itbook.store/img/books/1001620983366.png",
		"author" : "Stack Overflow Community",
		"rating" : 0,
		"published" : 2018,
		"price" : 0.00
	},
	{
		"title" : "MySQL, 4th Edition",
		"subtitle" : "",
		"publisher" : "Addison-Wesley",
		"isbn" : "9780132800754",
		"description" : "MySQL is an open source relational database management system that has experienced a phenomenal growth in popularity and use. Known for its speed and ease of use, MySQL has proven itself to be particularly well-suited for developing database-backed websites and applications.In MySQL, Paul DuBois pro...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780132800754.png",
		"author" : "Paul Dubois",
		"rating" : 0,
		"published" : 2008,
		"price" : 0.00
	},
	{
		"title" : "PHP and MySQL For Dummies, 3rd Edition",
		"subtitle" : "",
		"publisher" : "Wiley",
		"isbn" : "9780470096000",
		"description" : "Been thinking of creating a high-quality interactive Web site? This book is just what you need to get started! Here&#039;s the fun and easy way(r) to develop a Web application in PHP 4, 5, or 6 and MySQL 5, test your software, enable your Web pages to display, change, and move database information, ...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780470096000.png",
		"author" : "Janet Valade",
		"rating" : 4,
		"published" : 2006,
		"price" : 12.00
	},
	{
		"title" : "PHP & MySQL Web Development All-in-One Desk Reference For Dummies",
		"subtitle" : "",
		"publisher" : "Wiley",
		"isbn" : "9780470167779",
		"description" : "PHP &amp;amp; MySQL Web Development All-in-One Desk Reference For Dummies is kind of one-stop shopping for the information you need to get up and running with these tools and put them to good use. It&#039;s divided into six handy minibooks that cover setting up your environment, PHP programming, usi...",
		"book_cover_image_url" : "https://itbook.store/img/books/9780470167779.png",
		"author" : "Janet Valade, Bill Ballad, Tricia Ballad",
		"rating" : 3,
		"published" : 2008,
		"price" : 7.10
	}
]
